exade_request_debug.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:def="http://www.4d.com/namespace/default">
  <soapenv:Header/>
  <soapenv:Body>
    <def:webservice_tarificateur soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <webservice_tarificateurRequest xsi:type="xsd:string">
        <![CDATA[
<licence>GMB#7ùuQefujig8fu1+rulyXa)it</licence>
<code_courtier>815178</code_courtier>
<type_operation>2</type_operation>

<retournerLesErreurs />

<simulation>
  <date_effet>20251222</date_effet>
  <frac_assurance>12</frac_assurance>
  <type_credit>0</type_credit>
  <id_objetdufinancement>1</id_objetdufinancement>

  
  <assure>
    <numero>1</numero>
    <statut>1</statut>
    <type_adhesion>0</type_adhesion>
    <sexe>H</sexe>
    <nom>MARTIN</nom>
    <nom_naissance>MARTIN</nom_naissance>
    <prenom>Pierre</prenom>
    <adresse>42 avenue des Champs</adresse>
    <ville>Lyon</ville>
    <code_postal>69003</code_postal>
    <lieu_naissance>Lyon</lieu_naissance>
    <velIdPaysNaissance>118</velIdPaysNaissance>
    <idnationalite>84</idnationalite>
    <idPaysResidenceFiscale>84</idPaysResidenceFiscale>
    <codepostalvillenaissance></codepostalvillenaissance>
    <date_naissance>19850820</date_naissance>
    <franchise>90</franchise>
    <fumeur>N</fumeur>
    <deplacement_pro>1</deplacement_pro>
    <travaux_manuels>0</travaux_manuels>
    <travaux_hauteur>1</travaux_hauteur>
    <manip_produit_dangereux>1</manip_produit_dangereux>
    <telephone></telephone>
    <portable>0698765432</portable>
    <email>pierre.martin@test.com</email>
    <politique_expose>N</politique_expose>
    <proche_politique_expose>N</proche_politique_expose>
    <encours_lemoine>0</encours_lemoine>
    <categ_pro>2</categ_pro>
    <detail_profession></detail_profession>
  </assure>
  

  <assure>
    <numero>2</numero>
    <statut>1</statut>
    <type_adhesion>0</type_adhesion>
    <sexe>F</sexe>
    <nom>MARTIN</nom>
    <nom_naissance>DUBOIS</nom_naissance>
    <prenom>Marie</prenom>
    <adresse></adresse>
    <ville>PARIS</ville>
    <code_postal>75001</code_postal>
    <lieu_naissance>Marseille</lieu_naissance>
    <velIdPaysNaissance>118</velIdPaysNaissance>
    <idnationalite>84</idnationalite>
    <idPaysResidenceFiscale>84</idPaysResidenceFiscale>
    <codepostalvillenaissance></codepostalvillenaissance>
    <date_naissance>19870312</date_naissance>
    <franchise>90</franchise>
    <fumeur>N</fumeur>
    <deplacement_pro>1</deplacement_pro>
    <travaux_manuels>0</travaux_manuels>
    <travaux_hauteur>1</travaux_hauteur>
    <manip_produit_dangereux>1</manip_produit_dangereux>
    <telephone></telephone>
    <portable>+33600000000</portable>
    <email>client@example.com</email>
    <politique_expose>N</politique_expose>
    <proche_politique_expose>N</proche_politique_expose>
    <encours_lemoine>0</encours_lemoine>
    <categ_pro>1</categ_pro>
    <detail_profession></detail_profession>
  </assure>
  

  
    <pret>
      <id_pret>1</id_pret>
      <numero>1</numero>
      <type_pret>1</type_pret>
      <capital>40000000</capital>
      <taux>325</taux>
      <type_taux>1</type_taux>
      <duree>300</duree>
      <differe>0</differe>
      <amortissement>12</amortissement>
      <date_deblocage>20251222</date_deblocage>
    </pret>
  

  
    <garantie_pret>
      <id_assure>1</id_assure>
      <id_pret>1</id_pret>
      <garantie>2</garantie>
      <quotite>50</quotite> 
    </garantie_pret>
  
    <garantie_pret>
      <id_assure>2</id_assure>
      <id_pret>1</id_pret>
      <garantie>2</garantie>
      <quotite>50</quotite>
    </garantie_pret>
    
</simulation>
        ]]>
      </webservice_tarificateurRequest>
    </def:webservice_tarificateur>
  </soapenv:Body>
</soapenv:Envelope>